In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv("SampleData.csv")
df

            Position  Job Level   Salary
0   Business Analyst          1    30000
1  Junior Consultant          2    50000
2  Senior Consultant          3    60000
3            Manager          4    80000
4    Country Manager          5   110000
5     Region Manager          6   150000
6            Partner          7   200000
7     Senior Partner          8   300000
8            C-level          9   500000
9                CEO         10  1000000

In [4]:
df.head()

            Position  Job Level  Salary
0   Business Analyst          1   30000
1  Junior Consultant          2   50000
2  Senior Consultant          3   60000
3            Manager          4   80000
4    Country Manager          5  110000

In [5]:
df.tail()

         Position  Job Level   Salary
5  Region Manager          6   150000
6         Partner          7   200000
7  Senior Partner          8   300000
8         C-level          9   500000
9             CEO         10  1000000

In [8]:
df.shape

(10, 3)

In [9]:
df.columns

Index(['Position', 'Job Level', 'Salary'], dtype='object')

In [11]:
df.dtypes

Position     object
Job Level     int64
Salary        int64
dtype: object

In [12]:
df.info

<bound method DataFrame.info of             Position  Job Level   Salary
0   Business Analyst          1    30000
1  Junior Consultant          2    50000
2  Senior Consultant          3    60000
3            Manager          4    80000
4    Country Manager          5   110000
5     Region Manager          6   150000
6            Partner          7   200000
7     Senior Partner          8   300000
8            C-level          9   500000
9                CEO         10  1000000>

In [13]:
df.loc[0]

Position     Business Analyst
Job Level                   1
Salary                  30000
Name: 0, dtype: object

In [14]:
df.iloc[-1]

Position         CEO
Job Level         10
Salary       1000000
Name: 9, dtype: object

In [15]:
df.tail(n=1)

  Position  Job Level   Salary
9      CEO         10  1000000

In [16]:
df.iloc[[0,4,5]]

           Position  Job Level  Salary
0  Business Analyst          1   30000
4   Country Manager          5  110000
5    Region Manager          6  150000